Data Frames are row and column series

In [1]:
import numpy as np

In [4]:
import pandas as pd

In [9]:
from numpy.random import randn

In [83]:
df = pd.DataFrame(randn(5,4),columns = ['A','B','C','D'])

In [84]:
df

          A         B         C         D
0 -0.477821  0.144580 -0.356667 -0.077355
1 -0.878806  0.563297  0.751163 -0.208802
2 -0.578146 -0.775470  0.385211  0.031870
3  0.753318 -0.478050 -0.002571 -1.850068
4  0.022975 -0.415113 -1.462160 -0.805020

To gather single column

In [26]:
df['A']

0    1.456525
1    1.132572
2    0.353705
3    0.875818
4    0.194694
Name: A, dtype: float64

To gather multiple columns

In [28]:
df[['A','B']]

          A         B
0  1.456525 -0.421555
1  1.132572  0.665050
2  0.353705  1.144081
3  0.875818  1.214552
4  0.194694  1.467849

To add a new column

In [30]:
df['E'] = df['A'] + df['B']

In [32]:
df

          A         B         C         D         E
0  1.456525 -0.421555  0.048380  0.636424  1.034970
1  1.132572  0.665050  1.319720 -0.401904  1.797622
2  0.353705  1.144081  0.119171 -0.052203  1.497786
3  0.875818  1.214552  0.519432  0.507000  2.090370
4  0.194694  1.467849 -0.134899 -0.522407  1.662543

To drop a column

In [36]:
df.drop('E',axis=1,inplace=True)

In [38]:
df

          A         B         C         D
0  1.456525 -0.421555  0.048380  0.636424
1  1.132572  0.665050  1.319720 -0.401904
2  0.353705  1.144081  0.119171 -0.052203
3  0.875818  1.214552  0.519432  0.507000
4  0.194694  1.467849 -0.134899 -0.522407

In [24]:
type(df)

pandas.core.frame.DataFrame

In [22]:
type(df['A'])

pandas.core.series.Series

To filter data frame based on a row condition on multiple columns

In [49]:
df[(df['A'] > 1) & (df['B'] > 0)][['A','B','C']]

          A        B        C
1  1.132572  0.66505  1.31972

Missing data

Using copy method while creating a new data frame will help us to avoid overriting existing one

In [85]:
df_missing = df.copy()

Updating column A with a condition where A > 1 will be NaN

In [89]:
df_missing.loc[df_missing['A'] > 0, 'A'] = np.NaN

In [90]:
df_missing.loc[df_missing['B'] > 0, 'B'] = np.NaN

In [91]:
df_missing

          A         B         C         D
0 -0.477821       NaN -0.356667 -0.077355
1 -0.878806       NaN  0.751163 -0.208802
2 -0.578146 -0.775470  0.385211  0.031870
3       NaN -0.478050 -0.002571 -1.850068
4       NaN -0.415113 -1.462160 -0.805020

In [92]:
df_missing['A'] = df_missing['A'].fillna(value=99)

In [93]:
df_missing['B'] = df_missing['B'].fillna(value=df_missing['B'].mean())

In [94]:
df_missing

           A         B         C         D
0  -0.477821 -0.556211 -0.356667 -0.077355
1  -0.878806 -0.556211  0.751163 -0.208802
2  -0.578146 -0.775470  0.385211  0.031870
3  99.000000 -0.478050 -0.002571 -1.850068
4  99.000000 -0.415113 -1.462160 -0.805020

Group by method

To create a conditional column based on a column

In [109]:
df['Category'] = np.where(df['B']>=0, 'A', 'B')

In [110]:
df

          A         B         C         D Category
0 -0.477821  0.144580 -0.356667 -0.077355        A
1 -0.878806  0.563297  0.751163 -0.208802        A
2 -0.578146 -0.775470  0.385211  0.031870        B
3  0.753318 -0.478050 -0.002571 -1.850068        B
4  0.022975 -0.415113 -1.462160 -0.805020        B

In [108]:
df.groupby('Category').sum()

                 A         B         C         D
Category
A        -1.356628  0.707877  0.394495 -0.286157
B         0.198148 -1.668632 -1.079520 -2.623218

In [117]:
df.groupby('Category')['C'].sum()

Category
A    0.394495
B   -1.079520
Name: C, dtype: float64

In [121]:
df_missing['Category'] = np.where(df_missing['B']>=0, 'A', 'B')

In [122]:
df_missing

           A         B         C         D Category
0  -0.477821 -0.556211 -0.356667 -0.077355        B
1  -0.878806 -0.556211  0.751163 -0.208802        B
2  -0.578146 -0.775470  0.385211  0.031870        B
3  99.000000 -0.478050 -0.002571 -1.850068        B
4  99.000000 -0.415113 -1.462160 -0.805020        B

In [126]:
dfx

NameError: name 'dfx' is not defined

To append data frames

In [125]:
pd.concat([df,df_missing])

           A         B         C         D Category
0  -0.477821  0.144580 -0.356667 -0.077355        A
1  -0.878806  0.563297  0.751163 -0.208802        A
2  -0.578146 -0.775470  0.385211  0.031870        B
3   0.753318 -0.478050 -0.002571 -1.850068        B
4   0.022975 -0.415113 -1.462160 -0.805020        B
0  -0.477821 -0.556211 -0.356667 -0.077355        B
1  -0.878806 -0.556211  0.751163 -0.208802        B
2  -0.578146 -0.775470  0.385211  0.031870        B
3  99.000000 -0.478050 -0.002571 -1.850068        B
4  99.000000 -0.415113 -1.462160 -0.805020        B